namespace MbtiTest
{
    internal class PsychotypeProperties
    {
        public static string GetDescription(string abbreviation)
        {
            switch (abbreviation)
            {
                case "INTJ":
                    return "\"Архітектор\" — це концептуальний стратег (INTJ). Цей психологічний тип отримав свою назву завдяки перфекціонізму. Архітектори почуваються комфортніше, проводячи час на самоті. Тому їм підходить віддалена робота поза колективом. Люди з цим соціальним типом самоорганізовані та відповідальні. Завдяки раціональному мисленню та інтуїції вони легко втілюють свої ідеї в життя.";
                case "ISFJ":
                    return "Психологічний тип \"Захисник\" - справжній професіонал, чуйний та уважний. Цей тип - природжений адміністратор, легко працює віддалено та в єдиному командному дусі.";
                case "ISTP":
                    return "\"Віртуоз\" — логічний прагматик (ISTP). Люди, які належать до психологічного типу \"Віртуоз\", не слідують суворо правилам, дуже відверті, послідовні, лояльні, раціональні та логічні. Іноді вони навіть спонтанні.\r\n";
                case "ISFP":
                    return "\"Авантюристи\" — це універсальні помічники (ISFP). Чутливі авантюристи завжди в доброму гуморі, приваблюють своєю активністю, дружелюбністю та жагою до нових знань.";
                case "INFP":
                    return "\"Посередник\" — інтелектуальний ідеаліст (INFP). Представники цього соціального типу врівноважені й воліють занурюватися у свої ідеї. У них добре розвинені ціннісні орієнтації.";
                case "INTP":
                    return "“Логік” — об'єктивний аналітик (INTP). Люди, що належать до цього психологічного типу, вміють помічати помилки і вирішувати проблеми. Незважаючи на свою примхливість, вони дуже компетентні і віддають перевагу чітким алгоритмам роботи. Дистанційна робота не становить для них складності.";
                case "ESTP":
                    return "“Підприємці” — енергійні люди (ESTP). Вони сповнені ентузіазму, азартні, готові ризикувати, вирішувати складні завдання під тиском і кидатися на вирішення важких проблем. Підприємці не люблять монотонних і довгострокових завдань, а коли вони їх вирішують, їм важко зосередитися.";
                case "ESFP":
                    return "\"Артисти\" — ентузіасти та імпровізатори (ESFP). Енергійні та творчі, \"художники\" легко заводять дружбу і пропонують безліч ідей. Вони хороші співрозмовники й артисти, люблять увагу і завжди відкриті та щедрі.";
                case "ENFP":
                    return "\"Активісти\" — творчі мотиватори (ENFP). Активісти люблять суспільство і керуються емоціями. Вони люблять експериментувати, проникливі та мають гарну інтуїцію. Вони відстоюють нематеріальні цінності та вірять у свої ідеали.\r\n";
                case "ENTP":
                    return "“Полемісти” — це ініціативні дослідники (ENTP). Представники цього соціального типу - харизматичні інтелектуали, логічні, раціональні та об'єктивні. Водночас вони потребують розумової стимуляції. Вони не люблять рутинну роботу і воліють концентруватися на великих проектах та ідеях.";
                case "ESTJ":
                    return "“Адміністратори” — це компетентні організатори (ESTJ). Люди з цим психологічним типом мають відмінну посидючість і консервативність у прийнятті рішень. Менеджери легко справляються з рутинними завданнями на щоденній основі. У цьому їм допомагають методичний підхід і лояльність.";
                case "ESFJ":
                    return "“Радники” — надійні партнери (ESFJ). Представники психологічного типу консультанта соціологічно характеризуються як уважні, товариські, лояльні, що ставлять справу і колектив вище за власні інтереси. Вони насилу переносять віддалену роботу і не пропускають різноманітне особисте спілкування, зокрема й на неробочі теми.";
                case "ENFJ":
                    return "“Протагоніст” — співчутливий координатор (ENFJ). Люди з цим психологічним типом - вроджені лідери, якими керують і надихають емоції та інтуїція. Вони найвищою мірою орієнтовані на досягнення цілей, але водночас чутливі до проблем своїх колег. Цей соціонічний тип також відомий як коуч.";
                case "ENTJ":
                    return "\"Командири\" — це рішучі стратеги (ENTJ), які легко знаходять вихід зі складних ситуацій і усувають кордони. Це послідовні планувальники та стратеги, які професійні та продуктивні, особливо коли йдеться про цілі. Вони скоріше реалісти, ніж мрійники, і зачаровують своєю харизмою та впевненістю.\r\n";
                case "INFJ":
                    return "“Адвокати” — проникливі провидці (INFJ).  Люди,  які належать до психологічного типу адвоката, креативні, відвертіта мають добре розвинену інтуїцію. Вони емпатичні, уважні до почуттівіншихімислячі людиз різними ідеями.";
                case "ISTJ":
                    return "\"Логіки\" — відповідальні реалісти (ISTJ) .Людей,  які належать до психологічного типу \"Логік\", вирізняє послідовність, з якою вони виконують різні завдання. Вони люблять усе чітко і просто організовувати. ";
                default:
                    throw new UndefinedAbbreviatureException();
            }
        }
        public static string[] GetColors(string abbreviation)
        {
            switch (abbreviation)
            {
                case "INTJ":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "ISFJ":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "ISTP":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "ISFP":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "INFP":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "INTP":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "ESTP":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "ESFP":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" } ;
                case "ENFP":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" } ;
                case "ENTP":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" }         ;
                case "ESTJ":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "ESFJ":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "ENFJ":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "ENTJ":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "INFJ":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                case "ISTJ":
                    return new string[] { "#44403c", "#b45309", "#1a2e05" };
                default:
                    throw new UndefinedAbbreviatureException();
            }
        }

    }
}
