using System.Collections.Generic;

namespace MbtiTest
{
    internal class PsychotypeProperties
    {
        public static string GetDescription(string abbreviation)
        {
            switch (abbreviation)
            {
                case "INTJ":
                    return "\"Архітектори\" — незалежні і стратегічні, вони мислять довгостроково і логічно, розробляють плани для досягнення складних цілей. Також люблять планувати і вирішувати складні проблеми, володіють високими аналітичними здібностями. INTJ часто бачать картину в цілому і працюють над її реалізацією.";
                case "ISFJ":
                    return "\"Захисники\" - турботливі і віддані, вони люблять допомагати іншим і часто працюють у сферах, де можуть підтримувати людей. Також цінують гармонію і стабільність, віддані своїм обов'язкам і традиціям. ISFJ уважні до деталей і прагнуть створити комфортне середовище для себе та інших.";
                case "ISTP":
                    return "\"Віртуози\" — практичні і адаптивні, вони люблять працювати з інструментами і технікою, розв'язуючи проблеми в реальному часі. Також швидко реагують на зміну обставин і знаходять ефективні рішення. ISTP часто володіють хорошими навичками у технічних чи спортивних сферах.";
                case "ISFP":
                    return "\"Авантюристи\" — спокійні і гнучкі, вони цінують мистецтво і природу, насолоджуються моментом. Також орієнтовані на особисті цінності і естетику, часто мають творчі нахили. ISFP прагнуть жити згідно зі своїми переконаннями і створювати красу навколо себе.";
                case "INFP":
                    return "\"Посередники\" — ідеалістичні і творчі, вони прагнуть допомагати іншим і покращувати світ. Також мають багатий внутрішній світ і сильну уяву, часто пишуть або займаються мистецтвом. INFP орієнтовані на свої цінності і інтуїтивно відчувають потреби інших людей.";
                case "INTP":
                    return "\"Аналітики\" — аналітичні і логічні, вони цінують знання і інтелектуальну незалежність. Також прагнуть розуміти складні концепції і теоретичні проблеми, часто виявляють інтерес до наукових або філософських тем. INTP люблять розмірковувати над новими ідеями і знаходити нестандартні рішення.";
                case "ESTP":
                    return "\"Підприємці\" — енергійні і спритні, вони люблять ризик і нові враження, часто живуть у швидкому темпі. Також орієнтовані на негайні дії і практичні результати, швидко адаптуються до змін. ESTP мають добре розвинені соціальні навички і люблять перебувати в центрі уваги.";
                case "ESFP":
                    return "\"Артисти\" — енергійні і доброзичливі, вони люблять спілкування і розваги, цінують теперішній момент. Також орієнтовані на те, щоб приносити радість собі і оточуючим, часто є душею компанії. ESFP мають природну харизму і легко заводять друзів.";
                case "ENFP":
                    return "\"Активісти\" — ентузіастичні і творчі, вони завжди шукають нові ідеї і можливості, легко захоплюються новими проектами. Також прагнуть надихати і мотивувати інших, мають високий рівень емоційного інтелекту. ENFP володіють сильною уявою і здатністю бачити потенціал у кожній людині.";
                case "ENTP":
                    return "\"Полемісти\" — розумні і винахідливі, вони люблять дебати і виклики, завжди готові випробувати нові підходи. Також швидко знаходять нестандартні рішення і люблять експериментувати з новими ідеями. ENTP часто мають природну допитливість і здатність бачити можливості в будь-якій ситуації.";
                case "ESTJ":
                    return "\"Адміністратори\" — організовані і рішучі, вони люблять структуру і порядок, прагнуть досягати своїх цілей. Також орієнтовані на ефективність і результативність, часто займають лідерські позиції. ESTJ цінують традиції і правила, які допомагають їм підтримувати стабільність і порядок.";
                case "ESFJ":
                    return "\"Радники\" — доброзичливі і турботливі, вони цінують гармонію і співпрацю, орієнтовані на допомогу іншим. Також часто працюють у сферах, де можуть підтримувати і доглядати за людьми, добре розуміють емоції інших. ESFJ прагнуть створювати теплу і гармонійну атмосферу навколо себе.";
                case "ENFJ":
                    return "\"Протагоніст\" — харизматичні і емпатійні, вони прагнуть допомагати іншим розвиватися і досягати своїх цілей. Також мають сильні лідерські якості і вміння надихати, часто виступають як наставники або тренери. ENFJ орієнтовані на створення гармонійних відносин і мотивування оточуючих.";
                case "ENTJ":
                    return "\"Командири\" — рішучі і стратегічні, вони прагнуть досягати великих цілей і керувати проектами. Також мають сильні лідерські якості, вміння планувати і організовувати. ENTJ орієнтовані на ефективність і результативність, часто займають керівні позиції і надихають інших на досягнення високих результатів.\r\n\r\n\r\n\r\n\r\n\r\n";
                case "INFJ":
                    return "\"Адвокати\" — ідеалістичні і творчі, вони мають сильну інтуїцію і емпатію, часто виступають як наставники чи радники. Також прагнуть зрозуміти сенс життя і допомагати іншим реалізувати свій потенціал. INFJ мають глибокі переконання і вірять у важливість своїх цілей.";
                case "ISTJ":
                    return "\"Логіки\" — надійні та організовані, вони цінують традиції і порядок. Також орієнтовані на факти і деталізацію, виконують завдання методично і ефективно. ISTJ зазвичай дотримуються правил і процедур, відповідально ставляться до своїх обов’язків.";
                default:
                    throw new UndefinedAbbreviatureException();
            }
        }
        public static string[] GetColors(string abbreviation)
        {
            switch (abbreviation)
            {
                case "INTJ":
                    return new string[] { "#431407", "#022c22", "#713f12" };
                case "ISFJ":
                    return new string[] { "#14b8a6", "#134e4a", "#0c4a6e" };
                case "ISTP":
                    return new string[] { "#262626", "#f97316", "#14532d" };
                case "ISFP":
                    return new string[] { "#581c87", "#172554", "#fafafa" };
                case "INFP":
                    return new string[] { "#38bdf8", "#ec4899", "#e879f9" };
                case "INTP":
                    return new string[] { "#1a2e05", "#404040", "#0a0a0a" };
                case "ESTP":
                    return new string[] { "#b91c1c", "#f43f5e", "#f97316" };
                case "ESFP":
                    return new string[] { "#172554", "#be123c", "#fcd34d" };
                case "ENFP":
                    return new string[] { "#c2410c", "#0891b2", "#fef08a" };
                case "ENTP":
                    return new string[] { "#172554", "#2dd4bf", "#9a3412" };
                case "ESTJ":
                    return new string[] { "#a1a1aa", "#fed7aa", "#fafaf9" };
                case "ESFJ":
                    return new string[] { "#f472b6", "#93c5fd", "#6b7280" };
                case "ENFJ":
                    return new string[] { "#2e1065", "#be185d", "#52525b" };
                case "ENTJ":
                    return new string[] { "#991b1b", "#0c0a09", "#f5f5f5" };
                case "INFJ":
                    return new string[] { "#fde047", "#38bdf8", "#15803d" };
                case "ISTJ":
                    return new string[] { "#ffe4e6", "#713f12", "#262626" };
                default:
                    throw new UndefinedAbbreviatureException();
            }
        }
        public static Dictionary<string, string[]> GetAll()
        {
            return new Dictionary<string, string[]>
            {
                { "INTJ", new string[] { "#431407", "#022c22", "#713f12" }}, 
                { "ISFJ", new string[] { "#14b8a6", "#134e4a", "#0c4a6e" }},
                { "ISTP", new string[] { "#262626", "#f97316", "#14532d" }},
                { "ISFP", new string[] { "#581c87", "#172554", "#fafafa" }},
                { "INFP", new string[] { "#38bdf8", "#ec4899", "#e879f9" }},
                { "INTP", new string[] { "#1a2e05", "#404040", "#0a0a0a" }},
                { "ESTP", new string[] { "#b91c1c", "#f43f5e", "#f97316" }},
                { "ESFP", new string[] { "#172554", "#be123c", "#fcd34d" }},
                { "ENFP", new string[] { "#c2410c", "#0891b2", "#fef08a" }},
                { "ENTP", new string[] { "#172554", "#2dd4bf", "#9a3412" }},
                { "ESTJ", new string[] { "#a1a1aa", "#fed7aa", "#fafaf9" }},
                { "ESFJ", new string[] { "#f472b6", "#93c5fd", "#6b7280" }},
                { "ENFJ", new string[] { "#2e1065", "#be185d", "#52525b" }},
                { "ENTJ", new string[] { "#991b1b", "#0c0a09", "#f5f5f5" }},
                { "INFJ", new string[] { "#fde047", "#38bdf8", "#15803d" }},
                { "ISTJ", new string[] { "#ffe4e6", "#713f12", "#262626" }},
            };
        }
    }
}
